app/controllers/posts_controller.rb

	def index
		if params[:search]
			@posts = Post.tagged_with("#{params[:search]}")
		else
			@posts = Post.all
---
SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_451dcf9  ON posts_taggings_451dcf9.taggable_id = "posts".id AND posts_taggings_451dcf9.taggable_type = 'Post' AND posts_taggings_451dcf9.tag_id = 1 JOIN taggings posts_taggings_64875fc  ON posts_taggings_64875fc.taggable_id = "posts".id AND posts_taggings_64875fc.taggable_type = 'Post' AND posts_taggings_64875fc.tag_id = 2
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id